app/Controllers/EmployeeController.php

SELECT *
FROM `employees`
---
    public function Index()
{
    $employee = new Employee();
    $data['employee'] = $employee->findAll();

INSERT INTO `employees` (`first_name`, `last_name`, `email`, `phone`, `designation`) VALUES ('harika', 'qq', 'harika@example.com', '1234567890', '11')
---
    public function store(){
        $employee = new Employee();
        $data = [
            'first_name'=>$this->request->getpost('first_name'),
            'last_name'=>$this->request->getpost('last_name'),
            'email'=>$this->request->getpost('email'),
            'phone'=>$this->request->getpost('phone'),
            'designation'=>$this->request->getpost('designation'),
        ];

        $employee->save($data);